## 数据库加载

In [1]:
%load_ext sql

In [2]:
import pymysql 
pymysql.install_as_MySQLdb()
%sql mysql://stu2000013727:stu2000013727@162.105.146.37:43306

In [3]:
%sql use stu2000013727;

 * mysql://stu2000013727:***@162.105.146.37:43306
0 rows affected.

[]

## 查看所有表

In [4]:
%sql select* from account

 * mysql://stu2000013727:***@162.105.146.37:43306
6 rows affected.

[(9, None, '1111', 'ee79976c9380d5e337fc1c095ece8c8f22f91f306ceeb161fa51fecede2c4ba1'),
 (10, None, 'test233', 'ef797c8118f02dfb649607dd5d3f8c7623048c9c063d532cc95c5ed7a898a64f'),
 (11, None, 'testtest', '37268335dd6931045bdcdf92623ff819a64244b53d0e746d438797349d4da578'),
 (12, None, '11111111', 'ee79976c9380d5e337fc1c095ece8c8f22f91f306ceeb161fa51fecede2c4ba1'),
 (13, None, '1111111', 'ee79976c9380d5e337fc1c095ece8c8f22f91f306ceeb161fa51fecede2c4ba1'),
 (14, None, '111111', 'ee79976c9380d5e337fc1c095ece8c8f22f91f306ceeb161fa51fecede2c4ba1')]

In [5]:
%sql select * from bill

 * mysql://stu2000013727:***@162.105.146.37:43306
0 rows affected.

[]

In [6]:
%sql select * from diary

 * mysql://stu2000013727:***@162.105.146.37:43306
0 rows affected.

[]

In [7]:
%sql select * from friend

 * mysql://stu2000013727:***@162.105.146.37:43306
5 rows affected.

[(10, 10, ''), (11, 11, ''), (12, 12, ''), (13, 13, ''), (14, 14, '')]

In [8]:
%sql select * from message

 * mysql://stu2000013727:***@162.105.146.37:43306
0 rows affected.

[]

In [9]:
%sql select * from qq_user

 * mysql://stu2000013727:***@162.105.146.37:43306
1 rows affected.

[(None, '111111', None, None, None, '111111', None, 14)]

In [10]:
%sql select * from todolist

 * mysql://stu2000013727:***@162.105.146.37:43306
0 rows affected.

[]